# HasDeformedShapeSettings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..HasDeformedShapeSettings Method
AnalysisDisplayStyle Class See Also
---
If true style has deformed shape settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasDeformedShapeSettings()
```

Visual Basic
---
```text
Public Function HasDeformedShapeSettings As Boolean
```

Visual C++
---
```text
public:
bool HasDeformedShapeSettings()
```

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace